import { type ClassValue, clsx } from "clsx";
import { twMerge } from "tailwind-merge";

export function cn(...inputs: ClassValue[]) {
  return twMerge(clsx(inputs));
}

export const documentType = [
  { value: "Диплом", label: "Диплом" },
  { value: "Ангийн ажил", label: "Ангийн ажил" },
  { value: "Үйлдвэрийн дадлага", label: "Үйлдвэрийн дадлага" },
];

export const branch = [
  {
    value: "Мэдээлэл технологи, электроникийн сургууль",
    label: "Мэдээлэл технологи, электроникийн сургууль",
  },
  { value: "Бизнесийн сургууль", label: "Бизнесийн сургууль" },
  { value: "Хууль зүйн сургууль", label: "Хууль зүйн сургууль" },
  { value: "Шинжлэх ухааны сургууль", label: "Шинжлэх ухааны сургууль" },

  {
    value: "Инженер,технологийн сургууль",
    label: "Инженер,технологийн сургууль",
  },
  {
    value: "Улс төр судлал, олон улсын харилцаа, нийтийн удирдлагын сургууль",
    label: "Улс төр судлал, олон улсын харилцаа, нийтийн удирдлагын сургууль",
  },
];
export const keywords = [
  { value: "Хөгжүүлэлт", label: "Хөгжүүлэлт" },
  { value: "Мобайл хөгжүүлэлт", label: "Мобайл хөгжүүлэлт" },
  { value: "Веб хөгжүүлэлт", label: "Веб хөгжүүлэлт" },
  { value: "Судалгааны ажил", label: "Судалгааны ажил" },
  { value: "Машин сургалт", label: "Машин сургалт" },
  { value: "Системийн архитектур", label: "Системийн архитектур" },
];

export function truncateText(text: string, maxLength: number) {
  if (!text) return;
  if (text.length > maxLength) {
    return text.slice(0, maxLength) + "...";
  }
  return text;
}
export const filters = [
  {
    id: "branch",
    name: "Салбар сургууль",
    options: [
      { value: "Хууль зүйн сургууль", label: "Хууль зүйн сургууль" },
      { value: "Бизнесийн сургууль", label: "Бизнесийн сургууль" },
      { value: "Шинжлэх ухааны сургууль", label: "Шинжлэх ухааны сургууль" },
      {
        value: "Мэдээлэл технологи, электроникийн сургууль",
        label: "Мэдээлэл технологи, электроникийн сургууль",
      },
      {
        value: "Инженер,технологийн сургууль",
        label: "Инженер,технологийн сургууль",
      },
      {
        value: "Улс төр судлал, олон улсын харилцаа сургууль",
        label: "Улс төр судлал, олон улсын харилцаа сургууль",
      },
    ],
  },
  {
    id: "year",
    name: "Он",
    options: [
      { value: "2017", label: "2018 оноос бага" },
      { value: "2018", label: "2018 он" },
      { value: "2019", label: "2019 он" },
      { value: "2020", label: "2020 он" },
      { value: "2021", label: "2021 он" },
      { value: "2022", label: "2022 он" },
      { value: "2023", label: "2023 он" },
    ],
  },
  {
    id: "rate",
    name: "Дүн",
    options: [
      { value: "0-59", label: "0-59" },
      { value: "60-64", label: "60-64" },
      { value: "65-69", label: "65-69" },
      { value: "70-74", label: "70-74" },
      { value: "75-79", label: "75-79" },
      { value: "80-84", label: "80-84" },
      { value: "85-89", label: "85-89" },
      { value: "90-94", label: "90-94" },
      { value: "95-100", label: "95-100" },
    ],
  },
];

export const calculateDocumentType = (data: any) => {
  const documentSetData: Set<any> = new Set();

  data.forEach((item: any) => {
    const documentType = item.data.documentType;
    documentSetData.add(documentType);
  });
  return documentSetData;
};

// Нийт дипломын ажлыг тооцоолох

export function calculateDiploma(data: any) {
  const countDiploma = data.reduce((acc: any, currentItem: any) => {
    if (currentItem.data.documentType === "Диплом") {
      return acc + 1;
    }
    return acc;
  }, 0);

  return countDiploma;
}

// Нийт докторын ажлыг тооцоолох

export function calculateDoctor(data: any) {
  const countDiploma = data.reduce((acc: any, currentItem: any) => {
    if (currentItem.data.documentType === "Доктор") {
      return acc + 1;
    }
    return acc;
  }, 0);

  return countDiploma;
}
// Нийт магистрын ажлыг тооцоолох

export function calculateMagister(data: any) {
  const countDiploma = data.reduce((acc: any, currentItem: any) => {
    if (currentItem.data.documentType === "Магистр") {
      return acc + 1;
    }
    return acc;
  }, 0);

  return countDiploma;
}

// Оноор тооцоолох

export const calculateOverlapsByYear = (data: any) => {
  const countOverlapYear: any[] = [];
  const overlapsByYear: any = new Map<number, number>();

  data.forEach((item: any) => {
    const year = item.data.year;
    if (overlapsByYear.has(year)) {
      overlapsByYear.set(year, overlapsByYear.get(year) + 1);
    } else {
      overlapsByYear.set(year, 1);
    }
  });

  overlapsByYear.forEach((value: any, key: any) => {
    countOverlapYear.push([key, value]);
  });
  return countOverlapYear;
};

// Дүнгээр тооцоолох

export const calculateOverlapsByPoint = (data: any) => {
  const countOverlapPoint: any[] = [];
  const countMap = new Map();

  const updateCount = (countMap: any, region: any, value: any) => {
    const count = countMap.get(region) || 0;
    countMap.set(region, value ? count + 1 : count);
  };

  data.forEach((item: any) => {
    const { A, B, C, D } = calculateABCD(parseInt(item.data.rate));
    updateCount(countMap, "A", A);
    updateCount(countMap, "B", B);
    updateCount(countMap, "C", C);
    updateCount(countMap, "D", D);
  });
  countMap.forEach((value: any, key: any) => {
    countOverlapPoint.push([key, value]);
  });

  return countOverlapPoint;
};

export const calculateABCD = (point: any) => {
  const A = point <= 100 && point >= 90;
  const B = point <= 89 && point >= 80;
  const C = point >= 70 && point <= 79;
  const D = point >= 60 && point <= 69;
  return { A, B, C, D };
};

// estimate branch
export const calculateBranch = (data: any) => {
  const countOverlapBranch: any[] = [];
  const overlapsByBranch: any = new Map<number, number>();

  data.forEach((item: any) => {
    const year = item.data.branch;
    if (overlapsByBranch.has(year)) {
      overlapsByBranch.set(year, overlapsByBranch.get(year) + 1);
    } else {
      overlapsByBranch.set(year, 1);
    }
  });

  overlapsByBranch.forEach((value: any, key: any) => {
    countOverlapBranch.push([key, value]);
  });
  return countOverlapBranch;
};

// Тухайн оны дундаж дүнг тооцоолох

export const calculateAveragePoint = (filterData: any) => {
  const yearMap = new Map();

  filterData.forEach((item: any) => {
    const { year, rate } = item.data;
    if (yearMap.has(year)) {
      const current = yearMap.get(year);
      yearMap.set(year, {
        total: current.total + parseInt(rate),
        count: current.count + 1,
      });
    } else {
      yearMap.set(year, { total: parseInt(rate), count: 1 });
    }
  });

  const averageMap = new Map();

  yearMap.forEach((value, key) => {
    const average = value.total / value.count;
    averageMap.set(key, average);
  });

  return averageMap;
};

export const extractMapData = (mapData: any) => {
  const labels = [];
  const values = [];

  for (let [key, value] of mapData) {
    labels.push(key);
    values.push(value);
  }

  return { labels, values };
};

export const teacherjson = [
  {
    Багш_ажилтны_хувийн_дугаар: "cbc7e71defe03d9f8de203c1c328695b",
    Багш_ажилтны_овог: "Чагнаа",
    Багш_ажилтны_нэр: "Алтангэрэл",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Тэнхимийн эрхлэгч",
    Эзэмшсэн_боловсрол: "Доктор (Ph.D.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "altangerel@num.edu.mn",
    Албан_өрөөний_хаяг: "мэдээлэл байхгvй",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "adff3cc886ad4f5d9c05775be267459e",
    Багш_ажилтны_овог: "Намсрай",
    Багш_ажилтны_нэр: "Оюун-Эрдэнэ",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Профессор",
    Эзэмшсэн_боловсрол: "Доктор (Ph.D.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "oyunerdene@num.edu.mn",
    Албан_өрөөний_хаяг: "мэдээлэл байхгvй",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "03a230eb6bfdeca4d197884be28f4286",
    Багш_ажилтны_овог: "Самбуу",
    Багш_ажилтны_нэр: "Уянга",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Профессор",
    Эзэмшсэн_боловсрол: "Доктор (Ph.D.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "uyanga@num.edu.mn",
    Албан_өрөөний_хаяг: "Хичээлийн байр 3А-204",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "d82f2d8c90e0bb5aebe4a2283caf3d41",
    Багш_ажилтны_овог: "Дангаасүрэн",
    Багш_ажилтны_нэр: "Гармаа",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Зөвлөх профессор",
    Эзэмшсэн_боловсрол: "Доктор (Ph.D.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "garmaa@num.edu.mn",
    Албан_өрөөний_хаяг: "Хичээлийн байр 3А-202",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "4916906745fb4385830cd7bf612d769d",
    Багш_ажилтны_овог: "Бөхсүрэн",
    Багш_ажилтны_нэр: "Энхтуул",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Дэд профессор",
    Эзэмшсэн_боловсрол: "Доктор (Ph.D.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "enkhtuul.b@num.edu.mn",
    Албан_өрөөний_хаяг: "Хичээлийн байр 3А-202",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "51d6eef3fc66fc8790a2ec688a402b99",
    Багш_ажилтны_овог: "Намсрайдорж",
    Багш_ажилтны_нэр: "Мөнхцэцэг",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Дэд профессор",
    Эзэмшсэн_боловсрол: "Доктор (Ph.D.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "munkhtsetseg_n@num.edu.mn",
    Албан_өрөөний_хаяг: "Хичээлийн байр 3А-204",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "79644fa8427f6337a68da04d943e19f8",
    Багш_ажилтны_овог: "Пүрэвсүрэн",
    Багш_ажилтны_нэр: "Далайжаргал",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Дэд профессор",
    Эзэмшсэн_боловсрол: "Доктор (Ph.D.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "dalaijargal@num.edu.mn",
    Албан_өрөөний_хаяг: "Хичээлийн байр 3А-226",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "edb4189687f8518019648ddabd596e43",
    Багш_ажилтны_овог: "Пэрэнлэйлхүндэв",
    Багш_ажилтны_нэр: "Гантуяа",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Дэд профессор",
    Эзэмшсэн_боловсрол: "Доктор (Ph.D.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "gantuya.p@num.edu.mn",
    Албан_өрөөний_хаяг: "Хичээлийн байр 3А-225",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "fcd7a8eacb6e6061db33a9f70378d40c",
    Багш_ажилтны_овог: "Батсуурь",
    Багш_ажилтны_нэр: "Сувдаа",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Дэд профессор",
    Эзэмшсэн_боловсрол: "Доктор (Ph.D.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "suvdaa@num.edu.mn",
    Албан_өрөөний_хаяг: "Хичээлийн байр 3А-225",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "d9458b371585245cf95517169686d3cc",
    Багш_ажилтны_овог: "Төмөрбаатар ",
    Багш_ажилтны_нэр: "Цэрэннадмид",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Дэд профессор",
    Эзэмшсэн_боловсрол: "Доктор (Ph.D.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "tserennadmid@num.edu.mn",
    Албан_өрөөний_хаяг: "Хичээлийн байр 3А-206",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "d39d31221f0029ec4795330958d01d7e",
    Багш_ажилтны_овог: "Очирбат",
    Багш_ажилтны_нэр: "Анхтуяа",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Дэд профессор",
    Эзэмшсэн_боловсрол: "Доктор (Ph.D.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "ankhtuya@num.edu.mn",
    Албан_өрөөний_хаяг: "Хичээлийн байр 3А-206",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "51c607c3b3466b6f104950e8e9c8c2ed",
    Багш_ажилтны_овог: "Хорлоо",
    Багш_ажилтны_нэр: "Оюундолгор",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Дэд профессор",
    Эзэмшсэн_боловсрол: "Доктор (Ph.D.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "okhorloo@num.edu.mn",
    Албан_өрөөний_хаяг: "Хичээлийн байр 3А-206",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "ab43d211007d52125207c9050b013598",
    Багш_ажилтны_овог: "Сэнгээ",
    Багш_ажилтны_нэр: "Нямлхагва",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Дэд профессор",
    Эзэмшсэн_боловсрол: "Доктор (Ph.D.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "nyamlkhagva@num.edu.mn",
    Албан_өрөөний_хаяг: "Хичээлийн байр 3А-226",
    Дотуур_утас: 4126,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "b8b4a85e17c400297c948ccdca0fa24d",
    Багш_ажилтны_овог: "Мөнхжаргал",
    Багш_ажилтны_нэр: "Золжаргал",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Дэд профессор",
    Эзэмшсэн_боловсрол: "Доктор (Sc.D.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "ZOLJARGAL@NUM.EDU.MN",
    Албан_өрөөний_хаяг: "Хичээлийн байр 3А-105",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "265b77ce7e44a91d3ae439a42a3b4eb6",
    Багш_ажилтны_овог: "Батсүрэн",
    Багш_ажилтны_нэр: "Хуягбаатар",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Дэд профессор",
    Эзэмшсэн_боловсрол: "Доктор (Ph.D.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "khuyagbaatar@num.edu.mn",
    Албан_өрөөний_хаяг: "Хичээлийн байр 3А-105",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "d8b1727ab42b60cb2aadeb11a26f5b4d",
    Багш_ажилтны_овог: "Болд",
    Багш_ажилтны_нэр: "Наранчимэг",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Дэд профессор",
    Эзэмшсэн_боловсрол: "Магистр (M.Sc.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "naranchimeg@num.edu.mn",
    Албан_өрөөний_хаяг: "мэдээлэл байхгvй",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "8cb6bfb776280af1ffa4c38f8494a705",
    Багш_ажилтны_овог: "Ганболд",
    Багш_ажилтны_нэр: "Амарсанаа ",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Дэд профессор",
    Эзэмшсэн_боловсрол: "Доктор (Ph.D.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "amarsanaag@num.edu.mn",
    Албан_өрөөний_хаяг: "мэдээлэл байхгvй",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "839488d1022df353e1446512124e04c6",
    Багш_ажилтны_овог: "Довдон",
    Багш_ажилтны_нэр: "Энхзол",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Дэд профессор",
    Эзэмшсэн_боловсрол: "Доктор (Ph.D.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "enkhzol@num.edu.mn",
    Албан_өрөөний_хаяг: "мэдээлэл байхгvй",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "aa1a16784d10d7ef68078915b65e213f",
    Багш_ажилтны_овог: "Эрдэнэбаатар",
    Багш_ажилтны_нэр: "Цэцэгжаргал",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Ахлах багш",
    Эзэмшсэн_боловсрол: "Магистр (M.A.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "tsetsegjargal.e@num.edu.mn",
    Албан_өрөөний_хаяг: "мэдээлэл байхгvй",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "d0c7bb49c18f292367140b683254a4a2",
    Багш_ажилтны_овог: "Батаа",
    Багш_ажилтны_нэр: "Магсаржав",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Ахлах багш",
    Эзэмшсэн_боловсрол: "Доктор (Sc.D.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "magsarjav@num.edu.mn",
    Албан_өрөөний_хаяг: "мэдээлэл байхгvй",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "8bc9ad4179452d983624b4873a2dc44e",
    Багш_ажилтны_овог: "Ганболд",
    Багш_ажилтны_нэр: "Ууганбаяр",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Ахлах багш",
    Эзэмшсэн_боловсрол: "Доктор (Ph.D.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "uuganbayar.g@num.edu.mn",
    Албан_өрөөний_хаяг: "мэдээлэл байхгvй",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "8f605098c90d40c94eaec6003886ebc6",
    Багш_ажилтны_овог: "Жамьянсүрэн",
    Багш_ажилтны_нэр: "Үйтүмэн",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Ахлах багш",
    Эзэмшсэн_боловсрол: "Магистр (M.Edu.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "uitumen@num.edu.mn",
    Албан_өрөөний_хаяг: "Хичээлийн байр 3А-104",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "74428cd61b48d5f69081c128d6d07e5c",
    Багш_ажилтны_овог: "Цэдэндамба",
    Багш_ажилтны_нэр: "Хүрэл-Oчир",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Ахлах багш",
    Эзэмшсэн_боловсрол: "Магистр (M.Sc.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "khurel-ochir@num.edu.mn",
    Албан_өрөөний_хаяг: "Хичээлийн байр 3А-226",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "7572f8ff0b0ae1455c4c70311c1e75e0",
    Багш_ажилтны_овог: "Баттулга",
    Багш_ажилтны_нэр: "Батням",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Ахлах багш",
    Эзэмшсэн_боловсрол: "Магистр (M.Sc.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "bbatnyam@num.edu.mn",
    Албан_өрөөний_хаяг: "Хичээлийн байр 3А-225",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "20d690665a60d904d14780203a44b700",
    Багш_ажилтны_овог: "Шагдарсүрэн",
    Багш_ажилтны_нэр: "Бат-Өлзий",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Ахлах багш",
    Эзэмшсэн_боловсрол: "Магистр (M.Edu.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "batulzii@num.edu.mn",
    Албан_өрөөний_хаяг: "Хичээлийн байр 3А-204",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "7a44377fb7cfbfb480a1e29edc4b3bf1",
    Багш_ажилтны_овог: "Очирбат",
    Багш_ажилтны_нэр: "Отгоннаран",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Ахлах багш",
    Эзэмшсэн_боловсрол: "Магистр (M.Sc.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "otgonnaran@num.edu.mn",
    Албан_өрөөний_хаяг: "Хичээлийн байр 3А-202",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "e1f0b12f8c82dbc27c7f9e47505b9088",
    Багш_ажилтны_овог: "Лхагвасүрэн",
    Багш_ажилтны_нэр: "Ганчимэг",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Багш",
    Эзэмшсэн_боловсрол: "Магистр (M.Sc.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "l.ganchimeg@num.edu.mn",
    Албан_өрөөний_хаяг: "Хичээлийн байр 3А-202",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "ed53bfe515f61e677ede0be38350c8a7",
    Багш_ажилтны_овог: "Алтангэрэл",
    Багш_ажилтны_нэр: "Баатарбилэг",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Багш",
    Эзэмшсэн_боловсрол: "Магистр (M.Sc.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг:
      "a_bbileg@num.edu.mn, mta@num.edu.mn, digital_transform@num.edu.mn",
    Албан_өрөөний_хаяг: "Хичээлийн байр 3А-225",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "cd017f37941b703865190dc56aa55082",
    Багш_ажилтны_овог: "Сэрээтэр",
    Багш_ажилтны_нэр: "Батбаяр",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Багш",
    Эзэмшсэн_боловсрол: "Магистр (M.Sc.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "batbayar.s@num.edu.mn",
    Албан_өрөөний_хаяг: "Хичээлийн байр 3А-204",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "6c66b542084ce138a40d5e63d081c0e6",
    Багш_ажилтны_овог: "Иванов",
    Багш_ажилтны_нэр: "Бямбасүрэн",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Багш",
    Эзэмшсэн_боловсрол: "Магистр (M.Edu.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "byambaa@num.edu.mn",
    Албан_өрөөний_хаяг: "Хичээлийн байр 3А-202",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "ed7e3f6efa15e248ca80c369c81cd5cf",
    Багш_ажилтны_овог: "Зундуй",
    Багш_ажилтны_нэр: "Цолмон",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Багш",
    Эзэмшсэн_боловсрол: "Магистр (M.Edu.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "tsolmonz@num.edu.mn",
    Албан_өрөөний_хаяг: "Хичээлийн байр 3А-104",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "2484b717851d8da40f4a2f8d0150c84b",
    Багш_ажилтны_овог: "Цоодол",
    Багш_ажилтны_нэр: "Лхамролом",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Багш",
    Эзэмшсэн_боловсрол: "Магистр (M.Sc.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "lkhamrolom@num.edu.mn",
    Албан_өрөөний_хаяг: "Хичээлийн байр 3А-213",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "c9db00d5511e2efd2a7c82ec071587d6",
    Багш_ажилтны_овог: "Рэнцэндорж",
    Багш_ажилтны_нэр: "Жавхлан",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Багш",
    Эзэмшсэн_боловсрол: "Магистр (M.Sc.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "r.javkhlan@num.edu.mn",
    Албан_өрөөний_хаяг: "Хичээлийн байр 3А-213",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "e93c5a11a9a2c512658675b7d4596273",
    Багш_ажилтны_овог: "Гомбожав",
    Багш_ажилтны_нэр: "Гантулга",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Багш",
    Эзэмшсэн_боловсрол: "Магистр (М.Е.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "gantulga_g@num.edu.mn",
    Албан_өрөөний_хаяг: "Хичээлийн байр 3А-213",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "e2b0caa08a46c51aca984e886cd941fb",
    Багш_ажилтны_овог: "Керей",
    Багш_ажилтны_нэр: "Есенбек",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Багш",
    Эзэмшсэн_боловсрол: "Магистр (M.Sc.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "esenbek@num.edu.mn",
    Албан_өрөөний_хаяг: "Хичээлийн байр 3А-213",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "320051b454a41d7d1b7588195d0efb03",
    Багш_ажилтны_овог: "Дамбасүрэн",
    Багш_ажилтны_нэр: "Нанзадрагчаа",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Багш",
    Эзэмшсэн_боловсрол: "Магистр (M.Edu.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "noreply-project@num.edu.mn, nanzadragchaa@num.edu.mn",
    Албан_өрөөний_хаяг: "Хичээлийн байр 3А-213",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "e825fb87c9b2ef5fb2b7f9d44a680d7d",
    Багш_ажилтны_овог: "Бадраа",
    Багш_ажилтны_нэр: "Доржнамжирмаа",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Багш",
    Эзэмшсэн_боловсрол: "Магистр (M.Edu.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "dorjoo@num.edu.mn",
    Албан_өрөөний_хаяг: "Хичээлийн байр 3А-213",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "b32890bd38930d328c18804a69b3028e",
    Багш_ажилтны_овог: "Нямжав",
    Багш_ажилтны_нэр: "Даваасүрэн",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Багш",
    Эзэмшсэн_боловсрол: "Магистр (М.Е.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "davaasuren.n@num.edu.mn",
    Албан_өрөөний_хаяг: "мэдээлэл байхгvй",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "3620c004ff2ada8bacd3b234a8315384",
    Багш_ажилтны_овог: "Баянмөнх",
    Багш_ажилтны_нэр: "Наранбат",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Багш",
    Эзэмшсэн_боловсрол: "Магистр (М.Е.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "naranbat@num.edu.mn",
    Албан_өрөөний_хаяг: "мэдээлэл байхгvй",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "f8dabb735e74871d3e1bdabae21bc3cd",
    Багш_ажилтны_овог: "Алтанцэцэг",
    Багш_ажилтны_нэр: "Мөнхзул",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Багш",
    Эзэмшсэн_боловсрол: "Магистр (M.A.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "munkhzul.a@num.edu.mn",
    Албан_өрөөний_хаяг: "мэдээлэл байхгvй",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "e94e4f855c616fd1443390d1eb63986e",
    Багш_ажилтны_овог: "Гэндэнсүрэн",
    Багш_ажилтны_нэр: "Багаболд",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Багш",
    Эзэмшсэн_боловсрол: "Магистр (M.Edu.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "bagabold.g@num.edu.mn",
    Албан_өрөөний_хаяг: "мэдээлэл байхгvй",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "23d39621e43a2fcaabc68fcbfb311d2a",
    Багш_ажилтны_овог: "Пүрэвсүрэн",
    Багш_ажилтны_нэр: "Тулгаа",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Цагийн багш",
    Эзэмшсэн_боловсрол: "Бакалавр (B.Sc.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "ptulgaa@num.edu.mn, nomio@num.edu.mn, oyunomin@num.edu.mn",
    Албан_өрөөний_хаяг: "мэдээлэл байхгvй",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "fc94dc782c2539e4a2d2b436b4769a88",
    Багш_ажилтны_овог: "Болд",
    Багш_ажилтны_нэр: "Буянхишиг",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Цагийн багш",
    Эзэмшсэн_боловсрол: "Магистр (M.Edu.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "buyankhishig.b@num.edu.mn",
    Албан_өрөөний_хаяг: "мэдээлэл байхгvй",
    Дотуур_утас: 0,
  },

  {
    Багш_ажилтны_хувийн_дугаар: "b383ed37ddad58c10411382f8fa565ad",
    Багш_ажилтны_овог: "Мөнхбат",
    Багш_ажилтны_нэр: "Амарзаяа",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Тэнхимийн туслах ажилтан",
    Эзэмшсэн_боловсрол: "Бакалавр (B.Sc.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "amarzaya.m@num.edu.mn",
    Албан_өрөөний_хаяг: "мэдээлэл байхгvй",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "9bb3f8e93db10865569271cf2c520e11",
    Багш_ажилтны_овог: "Энх-Амгалан",
    Багш_ажилтны_нэр: "Саранцэцэг",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Тэнхимийн туслах ажилтан",
    Эзэмшсэн_боловсрол: "Бакалавр (B.Sc.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "sarantsetseg_e@num.edu.mn",
    Албан_өрөөний_хаяг: "Хичээлийн байр 3А-211",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "e820ab8f7db8999437e6ccdd67868f93",
    Багш_ажилтны_овог: "Гэрэлмаа",
    Багш_ажилтны_нэр: "Сайнхишиг",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Лаборант",
    Эзэмшсэн_боловсрол: "Магистр (M.Sc.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "sainkhishig@num.edu.mn",
    Албан_өрөөний_хаяг: "Хичээлийн байр 3А-222",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "503344f3ca252a1f37405ec84f27c0e2",
    Багш_ажилтны_овог: "Гомбожав",
    Багш_ажилтны_нэр: "Батдэлгэр ",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Лаборант",
    Эзэмшсэн_боловсрол: "Бакалавр (B.Sc.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "batdelger.g@num.edu.mn",
    Албан_өрөөний_хаяг: "Хичээлийн байр 3А-107",
    Дотуур_утас: 0,
  },
  {
    Багш_ажилтны_хувийн_дугаар: "8e12f2474fbe41c149b5f84e29479ec7",
    Багш_ажилтны_овог: "Түвшинбаатар",
    Багш_ажилтны_нэр: "Мөнх-Орших",
    Харьяалах_бүтцийн_нэгжийн_нэр: "Мэдээлэл, компьютерийн ухааны тэнхим",
    Харьяалах_бүтцийн_нэгжийн_дугаар: "71c9fc47d49e39f870df6cd4b4114ede",
    Албан_тушаал: "Лаборант",
    Эзэмшсэн_боловсрол: "Бакалавр  (B.E.)",
    Төлөв: "Ажиллаж байгаа",
    Имэйл_хаяг: "munkhorshikh@num.edu.mn",
    Албан_өрөөний_хаяг: "мэдээлэл байхгvй",
    Дотуур_утас: 0,
  },
];
